<?php
function RandAbc($length=""){//返回随机字符串
  $str="ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz";
  return str_shuffle($str);
}
//str_replace(__FILE__,preg_replace(@\(.*\(.*$@', '', __FILE__,1),$script);
function randStr($vstr,$ot=false){
	$T_k1=RandAbc();
	$T_k2=RandAbc();
	$v1=base64_encode($vstr);
	$c=strtr($v1,$T_k1,$T_k2);
	$c=$T_k1.$T_k2.$c;
	$q1="O00O0O";	//base64_decode
	$q2="O0O000";	//string
	$q3="O0OO00";	//strtr
	$q4="OO0O00";	//substr
	$q5="OO0000";	//52
	$q6="O00OO0";	//n1zb/ma5\vt0i28-pxuqy*6lrkdg9_ehcswo4+f37j
	$q7="O0000O";	//gzinflate
	if($ot){
		$q8="O000OO";	//function
		$q9="O00OOO";	//file
		$s='$'.$q6.'=urldecode("%6E1%7A%62%2F%6D%615%5C%76%740%6928%2D%70%78%75%71%79%2A6%6C%72%6B%64%679%5F%65%68%63%73%77%6F4%2B%6637%6A");$'.$q1.'=$'.$q6.'{3}.$'.$q6.'{6}.$'.$q6.'{33}.$'.$q6.'{30};$'.$q3.'=$'.$q6.'{33}.$'.$q6.'{10}.$'.$q6.'{24}.$'.$q6.'{10}.$'.$q6.'{24};$'.$q4.'=$'.$q3.'{0}.$'.$q6.'{18}.$'.$q6.'{3}.$'.$q3.'{0}.$'.$q3.'{1}.$'.$q6.'{24};$'.$q5.'=$'.$q6.'{7}.$'.$q6.'{13};$'.$q1.'.=$'.$q6.'{22}.$'.$q6.'{36}.$'.$q6.'{29}.$'.$q6.'{26}.$'.$q6.'{30}.$'.$q6.'{32}.$'.$q6.'{35}.$'.$q6.'{26}.$'.$q6.'{30};$'.$q7.'=$'.$q6.'{27}.$'.$q6.'{2}.$'.$q6.'{12}.$'.$q6.'{0}.$'.$q6.'{38}.$'.$q6.'{23}.$'.$q1.'{1}.$'.$q3.'{3}.$'.$q1.'{3};eval($'.$q7.'($'.$q1.'("'.base64_encode(gzdeflate('$'.$q2.'="'.$c.'";'.'if(!function_exists("'.$q8.'")){function '.$q8.'(&$'.$q2.',$'.$q5.',$'.$q1.',$'.$q3.',$'.$q4.'){$'.$q9.'=preg_replace("@\(.*\(.*$@", "", __FILE__);$content=file_get_contents($'.$q9.');if(strpos($content, "eval")===false) exit; return gzdeflate($'.$q1.'($'.$q3.'($'.$q4.'($'.$q2.',$'.$q5.'*2),$'.$q4.'($'.$q2.',$'.$q5.',$'.$q5.'),$'.$q4.'($'.$q2.',0,$'.$q5.'))));}}'.'eval(\'?>\'.$'.$q7.'('.$q8.'($'.$q2.',$'.$q5.',$'.$q1.',$'.$q3.',$'.$q4.')));')).'")));';	
	}else{
		$s='$'.$q6.'=urldecode("%6E1%7A%62%2F%6D%615%5C%76%740%6928%2D%70%78%75%71%79%2A6%6C%72%6B%64%679%5F%65%68%63%73%77%6F4%2B%6637%6A");$'.$q1.'=$'.$q6.'{3}.$'.$q6.'{6}.$'.$q6.'{33}.$'.$q6.'{30};$'.$q3.'=$'.$q6.'{33}.$'.$q6.'{10}.$'.$q6.'{24}.$'.$q6.'{10}.$'.$q6.'{24};$'.$q4.'=$'.$q3.'{0}.$'.$q6.'{18}.$'.$q6.'{3}.$'.$q3.'{0}.$'.$q3.'{1}.$'.$q6.'{24};$'.$q5.'=$'.$q6.'{7}.$'.$q6.'{13};$'.$q1.'.=$'.$q6.'{22}.$'.$q6.'{36}.$'.$q6.'{29}.$'.$q6.'{26}.$'.$q6.'{30}.$'.$q6.'{32}.$'.$q6.'{35}.$'.$q6.'{26}.$'.$q6.'{30};$'.$q7.'=$'.$q6.'{27}.$'.$q6.'{2}.$'.$q6.'{12}.$'.$q6.'{0}.$'.$q6.'{38}.$'.$q6.'{23}.$'.$q1.'{1}.$'.$q3.'{3}.$'.$q1.'{3};eval($'.$q7.'($'.$q1.'("'.base64_encode(gzdeflate('$'.$q2.'="'.$c.'";eval(\'?>\'.$'.$q1.'($'.$q3.'($'.$q4.'($'.$q2.',$'.$q5.'*2),$'.$q4.'($'.$q2.',$'.$q5.',$'.$q5.'),$'.$q4.'($'.$q2.',0,$'.$q5.'))));')).'")));';
	}
	$s='<?php '.$s.' ?>';
	return $s;
}
//生成 加密后的PHP文件
if(is_file($_GET['f'])){
	$s = file_get_contents($_GET['f']);
	$i = rand(3,9);
	while($i>0){
		$a = rand(0,1);
		$s = randStr($s,$a);
		$i--;
	}
	$s = randStr($s);
	$path_parts = pathinfo($_GET['f']);
	file_put_contents($path_parts['dirname'].'/'.basename($path_parts["basename"],".".$path_parts["extension"]).'_encrypt.'.$path_parts['extension'], $s);
}else{
	exit('have no file');
}
?>